cos284-ics.org
#+TITLE: COS 284---Introduction to Computer Systems
#+DATE: Spring, 2016

#+STARTUP: indent
#+OPTIONS: toc:nil author:nil ':t

#+LATEX_CLASS: syllabus
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[margin=1.5in]{geometry}
#+LATEX_HEADER: \usepackage{lastpage}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \lhead{COS 284---Introduction to Computer Systems}
#+LATEX_HEADER: \chead{}
#+LATEX_HEADER: \rhead{Course Syllabus}
#+LATEX_HEADER: \lfoot{Spring 2016}
#+LATEX_HEADER: \cfoot{}
#+LATEX_HEADER: \rfoot{Page \thepage\ of \pageref{LastPage}}
#+LATEX_HEADER: \renewcommand{\headrulewidth}{0.4pt}
#+LATEX_HEADER: \renewcommand{\footrulewidth}{0.4pt}
#+LATEX_HEADER: \renewcommand\maketitle\relax

#+COLUMNS: %25ITEM %9TODO %10PRIORITY %5TAGS
* Instructor
*Dr. Tom Nurkkala*\\
Associate Professor, Computer Science and Engineering\\
Director, Taylor Center for Missions Computing\\
Office: Euler Science Complex 211\\
E-Mail: =tnurkkala@cse.taylor.edu=\\
Phone: 8-5163\\
Hours: MW\nbsp{}2:00-4:00, R\nbsp{}1:00-2:00, or by appointment\\

* Credit
This course is based on the Introduction to Computer Systems course at Carnegie Mellon
University (CMU). Professors Randal Bryant and David O’Hallaron, who developed the course
and wrote the textbook (Section 5), have generously made available course material
(including notes, syllabi, laboratory exercises, and lecture slides) for use at other
institutions. I make considerable use of their excellent materials throughout the course
(including in this document!) and wish to credit and thank them.

I have also drawn liberally from previous offerings of this course at Taylor University,
and wish to thank Professor Jonathan Geisler for his kind assistance.

* Course Overview
The aim of the course is to help you become a better programmer by teaching you the basic
concepts underlying all computer systems. I want you to learn what really happens when
your programs run, so that when things go wrong (as they always do) you will have the
intellectual tools to solve the problem.

Why do you need to understand computer systems if you do all of your programming in
high-level languages? In most of computer science, we're pushed to make abstractions and
stay within their frameworks. But, any abstraction ignores effects that can become
critical. As an analogy, Newtonian mechanics ignores relativistic effects. The Newtonian
abstraction is completely appropriate for bodies moving at less than $0.1c$, but higher
speeds require working at a greater level of detail.

The following "realities" are some of the major areas where the abstractions you've
learned in previous classes break down:
1. /An =int= isn't an integer; a =float= isn't a real/.
   Our finite representations of numbers have significant limitations,
   and because of these limitations
   we sometimes have to think in terms of bit-level representations.
2. /You've got to know assembly language/.
   Even if you never write programs in assembly,
   the behavior of a program sometimes cannot be understood
   based purely on the abstraction of a high-level language.
   Furthermore, understanding the effects of bugs
   requires familiarity with the machine-level model.
3. /Memory matters/.
   Computer memory is not unbounded.
   It must be allocated and managed.
   Memory referencing errors are especially pernicious.
   An erroneous updating of one object can cause a change
   in some logically unrelated object.
   Also, the combination of caching and virtual memory
   provides the functionality of a uniform unbounded address space,
   but not the performance.
4. /There is more to performance than asymptotic complexity/.
   Constant factors also matter.
   There are systematic ways to evaluate and improve program performance.
5. /Computers do more than execute instructions/.
   They also need to get data in and out
   and they interact with other systems over networks.

By the end of the course, you will understand these realities in some detail.
As a result, you will have learned skills and knowledge
that will help you throughout your education and career as a computer scientist.

* Learning Objectives

By the end of the semester, you should be able to:

1. Describe how a computer represents integers internally.
2. Convert twos complement binary values to decimal.
3. Convert binary to decimal and hexadecimal.
4. Understand how a computer represents fractional values.
5. Convert a fractional decimal value to its IEEE single- or double-precision representation.
6. Read x86 assembly code.
7. Write simple x86 assembly functions.
8. Describe how a computer executes a function call
   including parameters, return values, and the stack.
9. Describe how compilers convert C code to x86 assembly.
10. Explain how various C data structures are accessed in x86 assembly.
11. Describe the motivation for a memory hierarchy.
12. Explain how a memory hierarchy works.
13. Understand how a cache is organized internally.
14. Create programs that take advantage of the memory hierarchy.
15. Explain how a linker works.
16. Contrast static and dynamic linking.
17. Explain what a system call is and how system calls work.
18. Explain the fork system call.
19. Explain the exec family of system calls.
20. Describe how hardware and the operating system cooperate to deal with exceptional
    situations.
21. Measure the performance of an application accurately.
22. Improve the performance of an application based on good measurement techniques.
23. Understand virtual memory and how it works.
24. Explain the benefits of virtual memory.
25. Explain the role of the translation look-aside buffer.
26. Describe the virtual memory organization
    of a process running with Linux on an x86 processor.
27. Explain how a dynamic memory allocator works.
28. Be familiar with garbage collection.
29. Be familiar with common memory bugs and how to avoid them.
30. Explain what concurrent computation is and how to achieve it.
31. Contrast process-based concurrency with I/O multiplexing-based concurrency.
32. Describe why synchronization is necessary.
33. Be familiar with how to achieve synchronization.

* Texts
The text by Bryant and O'Halaron\nbsp{}\cite{cs:app3} is required.
We will refer to it as =CS:APP=.
You may be able to make use of the previous edition\nbsp{}\cite{cs:app2} of the text,
but I will not guarantee that all the material in the course will be
covered by that edition.
You are /encouraged/ to purchase---or have readily available---the
updated edition of "K&R," the classic reference on C.\cite{k&r}

It is /very important/ that you read carefully
the assigned readings in the =CS:APP= book.
You will get the most benefit if you read assigned passages
/before/ they are covered in class.
A detailed guide to reading assignments can be found in the course schedule.

The textbook includes many practice problems throughout the body of each chapter. These
are straightforward exercises that help you understand the material you have just read by
using it /immediately/. For self-study, solutions for all practice problems appear at the
end of each chapter.

In short, the best way to use the textbook to enhance your learning is as follows:
1. Read the assigned readings /before/ the corresponding class.
2. Work the practice problems /immediately/ as you encounter them in the text.
3. Check your work—and your understanding—with the answer key.

