cos284-ics.tex
% Created 2016-02-02 Tue 21:42
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{booktabs}
\usepackage[margin=1.5in]{geometry}
\usepackage{lastpage}
\usepackage{fancyhdr}
\pagestyle{fancy}
\lhead{COS 284---Introduction to Computer Systems}
\chead{}
\rhead{Course Syllabus}
\lfoot{Spring 2016}
\cfoot{}
\rfoot{Page \thepage\ of \pageref{LastPage}}
\renewcommand{\headrulewidth}{0.4pt}
\renewcommand{\footrulewidth}{0.4pt}
\renewcommand\maketitle\relax
\date{Spring, 2016}
\title{COS 284---Introduction to Computer Systems}
\hypersetup{
 pdfauthor={Tom Nurkkala},
 pdftitle={COS 284---Introduction to Computer Systems},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Instructor}
\label{sec:orgheadline1}
\textbf{Dr. Tom Nurkkala}\\
Associate Professor, Computer Science and Engineering\\
Director, Taylor Center for Missions Computing\\
Office: Euler Science Complex 211\\
E-Mail: \texttt{tnurkkala@cse.taylor.edu}\\
Phone: 8-5163\\
Hours: MW~2:00-4:00, R~1:00-2:00, or by appointment\\

\section{Credit}
\label{sec:orgheadline2}
This course is based on the Introduction to Computer Systems course at Carnegie Mellon
University (CMU). Professors Randal Bryant and David O’Hallaron, who developed the course
and wrote the textbook (Section 5), have generously made available course material
(including notes, syllabi, laboratory exercises, and lecture slides) for use at other
institutions. I make considerable use of their excellent materials throughout the course
(including in this document!) and wish to credit and thank them.

I have also drawn liberally from previous offerings of this course at Taylor University,
and wish to thank Professor Jonathan Geisler for his kind assistance.

\section{Course Overview}
\label{sec:orgheadline3}
The aim of the course is to help you become a better programmer by teaching you the basic
concepts underlying all computer systems. I want you to learn what really happens when
your programs run, so that when things go wrong (as they always do) you will have the
intellectual tools to solve the problem.

Why do you need to understand computer systems if you do all of your programming in
high-level languages? In most of computer science, we're pushed to make abstractions and
stay within their frameworks. But, any abstraction ignores effects that can become
critical. As an analogy, Newtonian mechanics ignores relativistic effects. The Newtonian
abstraction is completely appropriate for bodies moving at less than \(0.1c\), but higher
speeds require working at a greater level of detail.

The following ``realities'' are some of the major areas where the abstractions you've
learned in previous classes break down:
\begin{enumerate}
\item \emph{An \texttt{int} isn't an integer; a \texttt{float} isn't a real}.
Our finite representations of numbers have significant limitations,
and because of these limitations
we sometimes have to think in terms of bit-level representations.
\item \emph{You've got to know assembly language}.
Even if you never write programs in assembly,
the behavior of a program sometimes cannot be understood
based purely on the abstraction of a high-level language.
Furthermore, understanding the effects of bugs
requires familiarity with the machine-level model.
\item \emph{Memory matters}.
Computer memory is not unbounded.
It must be allocated and managed.
Memory referencing errors are especially pernicious.
An erroneous updating of one object can cause a change
in some logically unrelated object.
Also, the combination of caching and virtual memory
provides the functionality of a uniform unbounded address space,
but not the performance.
\item \emph{There is more to performance than asymptotic complexity}.
Constant factors also matter.
There are systematic ways to evaluate and improve program performance.
\item \emph{Computers do more than execute instructions}.
They also need to get data in and out
and they interact with other systems over networks.
\end{enumerate}

By the end of the course, you will understand these realities in some detail.
As a result, you will have learned skills and knowledge
that will help you throughout your education and career as a computer scientist.

\section{Learning Objectives}
\label{sec:orgheadline4}

By the end of the semester, you should be able to:

\begin{enumerate}
\item Describe how a computer represents integers internally.
\item Convert twos complement binary values to decimal.
\item Convert binary to decimal and hexadecimal.
\item Understand how a computer represents fractional values.
\item Convert a fractional decimal value to its IEEE single- or double-precision representation.
\item Read x86 assembly code.
\item Write simple x86 assembly functions.
\item Describe how a computer executes a function call
including parameters, return values, and the stack.
\item Describe how compilers convert C code to x86 assembly.
\item Explain how various C data structures are accessed in x86 assembly.
\item Describe the motivation for a memory hierarchy.
\item Explain how a memory hierarchy works.
\item Understand how a cache is organized internally.
\item Create programs that take advantage of the memory hierarchy.
\item Explain how a linker works.
\item Contrast static and dynamic linking.
\item Explain what a system call is and how system calls work.
\item Explain the fork system call.
\item Explain the exec family of system calls.
\item Describe how hardware and the operating system cooperate to deal with exceptional
situations.
\item Measure the performance of an application accurately.
\item Improve the performance of an application based on good measurement techniques.
\item Understand virtual memory and how it works.
\item Explain the benefits of virtual memory.
\item Explain the role of the translation look-aside buffer.
\item Describe the virtual memory organization
of a process running with Linux on an x86 processor.
\item Explain how a dynamic memory allocator works.
\item Be familiar with garbage collection.
\item Be familiar with common memory bugs and how to avoid them.
\item Explain what concurrent computation is and how to achieve it.
\item Contrast process-based concurrency with I/O multiplexing-based concurrency.
\item Describe why synchronization is necessary.
\item Be familiar with how to achieve synchronization.
\end{enumerate}

\section{Texts}
\label{sec:orgheadline5}
The text by Bryant and O'Halaron~\cite{cs:app3} is required.
We will refer to it as \texttt{CS:APP}.
You may be able to make use of the previous edition~\cite{cs:app2} of the text,
but I will not guarantee that all the material in the course will be
covered by that edition.
You are \emph{encouraged} to purchase---or have readily available---the
updated edition of ``K\&R,'' the classic reference on C.\cite{k&r}

It is \emph{very important} that you read carefully
the assigned readings in the \texttt{CS:APP} book.
You will get the most benefit if you read assigned passages
\emph{before} they are covered in class.
A detailed guide to reading assignments can be found in the course schedule.

The textbook includes many practice problems throughout the body of each chapter. These
are straightforward exercises that help you understand the material you have just read by
using it \emph{immediately}. For self-study, solutions for all practice problems appear at the
end of each chapter.

In short, the best way to use the textbook to enhance your learning is as follows:
\begin{enumerate}
\item Read the assigned readings \emph{before} the corresponding class.
\item Work the practice problems \emph{immediately} as you encounter them in the text.
\item Check your work—and your understanding—with the answer key.
\end{enumerate}
