cos284-ics.org
* Topics
These are the topics that could potentially be covered in the course.
It is unlikely that we will have time to cover all this material.
+ Course Overview
+ Bits and Bytes
  - Basics
  - Integers
  - Floating Point
+ Machine Programming
  - Basics
  - Control
  - Procedures
  - Data
  - Advanced
+ Program Optimization
+ Memory Hierarchy
+ Cache Memory
+ Linking
+ Exceptional Control Flow
  - Exceptions and Processes
  - Signals and Non-Local Jumps
+ Virtual Memory
  - Concepts
  - Systems
+ Dynamic Memory
  - Basic
  - Advanced
+ Internetworking
  - Network Programming
  - Web Servers
+ Concurrent Programming
  - Sychronization
* Labs

The labs come directly from the textbook authors. They have a very nice system set up so
that you can test and submit all your programs online and will already know how you are
doing on the assignment prior to submission. This should make it very easy to know when
you have a correct solution and when you need to keep working.

Please do not look for solutions online. Doing so constitutes cheating.  The authors have
introduced randomness into the assignments so solutions posted by others may be wrong
anyway.

You will use Linux for all lab work. For some labs, you will be given a binary that works
on the CSE machines, but should probably work on any recent vintage of Linux. For others,
you are required to develop code for a Linux box. You may use any machine to develop, but
/it must run correctly on the CSE machines/. You must check your work on the machines in the
laboratories before submitting it.

Most low-level systems code is written in\nbsp{}C, and you will be required to do the same. You
will also be required to read, understand, generate, or otherwise fiddle with x86 assembly
on a Linux box.

* Evaluation
The grading scheme for the course will be announced in the next few days.

# The grading breakdown for the course is as follows:

# #+ATTR_LATEX: :booktabs t
# | Deliverable          | Weight |
# |----------------------+--------|
# |                      |    <r> |
# | Assignments (weekly) |    20% |
# | Labs (x6)            |    40% |
# | Exams (x3)           |    25% |
# | Final                |    15% |
# |----------------------+--------|
# | Total                |   100% |

# Refer to the Periodic Table of the Grades (on Moodle) for the grading scheme. I reserve
# the right to award a higher grade than strictly earned; outstanding attendance and class
# participation figure prominently in such decisions.
* Moodle

The Computer Science and Engineering department uses Moodle as our Learning Management
System. The URL for Moodle is https://moodle.cse.taylor.edu. To sign on to the course site
for the first time, you will need an enrollment key. The key for this course is
=nerds4christ=.

You are responsible for checking Moodle regularly to keep up with assignment due dates and
other announcements posted to the site. For due dates, the Moodle calendar is your friend.
* Classroom Expectations

Following are my expectations about classroom conduct.

** Attendance

Attendance is required. I will be in class each day, and I expect you to be there also. I
will log who attends class.

In general, I am very understanding about students who must miss class due to a sanctioned
Taylor activity, medical appointment, job interview, family emergency, and the like. If
possible, let me know in advance that you will not be in class; I will work with you to
arrange make-up instruction, homework, exams, etc.

** Conduct

I expect you to be prepared, awake, aware, and participatory during class. I will not
hesitate to ask you to stand or move if you are distracted or sleepy.

I expect you to join in discussions, respond to questions from me and from your
colleagues, and ask questions of me. I expect you to hold my feet to the fire if I am
being unclear, unkind, or contradictory.

** Gizmos

You may not use a laptop, tablet, or similar device to check e-mail, engage in social
networking, surf the web, or any other activity not directly relevant to current classroom
activity.

If you use an electronic gizmo during class for legitimate academic purposes (e.g., note
taking), be prepared to demonstrate relevant use on demand at any time.

* Academic Integrity

As a student at an institution whose goal is to honor Christ in all that it does, i expect
you to uphold the strictest standards of academic integrity. You must do your own work,
cite others when you present their work, and never misrepresent your academic performance
in any way. Violation of these standards stains the reputations of you as a student,
Taylor as an institution, and Jesus as our Lord. Such a violation may result in your
failing the course and other disciplinary action by the University. Refer to the Taylor
catalog for the official statement of these ideas.

** What Constitutes Cheating?

For purposes of this course, the following are /non-exhaustive/ examples of violations of
academic integrity.

1. Sharing code or other electronic files by copying, retyping, looking at, or supplying a
   copy of a file from this or a previous semester. Be sure to store your work in
   protected directories, and screen lock or log off a lab machine to prevent others from
   copying your work without your explicit assistance.
2. Sharing written assignments or exams by looking at, copying, or supplying an assignment
   or exam.
3. Using other's code. Using code from this or previous offerings of the class, from
   courses at other institutions, or from any other source (e.g., software found on the
   Internet).
4. Looking at other's code. Although mentioned above, it bears repeating. Looking at other
   students' code or allowing others to look at yours is cheating. There is no notion of
   looking “too much,” since no looking is allowed at all.

