cos284-ics.org
** What Does Not Constitute Cheating?

In contrast, the following are non-exhaustive examples of activities that do not violate
academic integrity.

1. Clarifying ambiguities or vague points in class handouts or textbooks.
2. Helping others use the computer systems, networks, compilers, debuggers, profilers, or
   other system facilities.
3. Helping others with high-level design issues.
4. Helping others with high-level (not code-based) debugging.
5. Using code from the =CS:APP= website or from the class web pages.

Be sure to store your work in protected directories, and log off when you leave an open
cluster, to prevent others from copying your work without your explicit assistance.

#+LATEX: \bibliographystyle{plain}
#+LATEX: \bibliography{courses}

# | Wk | Day | Ln | Topic                            | Reading           | HW Due | Lab Due    | Exam            |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |    | <c> |    |                                  | <l>               | <l>    |            |                 |
# | 1  | W   |  1 | Overview                         | 1                 |        |            |                 |
# |    | F   |  2 | Bits and Bytes                   | 2.1               |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  2 | M   |  3 | Integers                         | 2.2-2.3           | Ch 2a  |            |                 |
# |    | W   |  4 |                                  |                   |        |            |                 |
# |    | F   |  5 | Floating Point                   | 2.4               | Ch 2b  |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  3 | M   |  6 | Machine Programming: Basics      | 3.1-3.3           | Ch 2c  |            |                 |
# |    | W   |  7 |                                  | 3.4-3.5, 3.13.1-3 |        | Data Lab   |                 |
# |    | F   |  8 | Machine Programming: Control     | 3.6, 3.13.4       |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  4 | M   |  9 | Machine Programming: Procedures  | 3.7               | Ch 3a  |            |                 |
# |    | W   | 10 | Machine Programming: Data        | 3.8               |        |            |                 |
# |    | F   | 11 |                                  | 3.9, 3.13.5       |        | Bomb Lab   |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  5 | M   | 12 | Machine Programming: Advanced    | 3.10-3.12         | Ch 3b  |            |                 |
# |    | W   | 13 |                                  | 3.14-3.15         |        |            |                 |
# |    | F   | 14 | Review for Exam 1                |                   | Ch 3c  |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  6 | M   | 15 | Program Optimization             | 5.1-5.5           |        |            | Exam 1 (Ch 1-3) |
# |    | W   | 16 |                                  | 5.6-5.10          |        | Buf Lab    |                 |
# |    | F   | 16 |                                  |                   |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  7 | M   | 17 |                                  | 5.11-5.15         |        |            |                 |
# |    | W   | 18 | Memory Hierarchy                 | 6.1-6.3           | Ch 5   |            |                 |
# |    | F   | 19 | Cache Memories                   | 6.4               |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  8 | M   | 20 |                                  | 6.5-6.7           |        |            |                 |
# |    | W   | 21 | Linking                          | 7.1-7.7           | Ch 6   |            |                 |
# |    | F   | 22 |                                  | 7.8-7.14          |        | Cache Lab  |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# |  9 | M   | 22 |                                  |                   |        |            |                 |
# |    | W   | 22 |                                  |                   |        |            |                 |
# |    | F   | 22 |                                  |                   |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# | 10 | M   | 22 |                                  |                   |        |            |                 |
# |    | W   | 23 | Review for Exam 2                |                   | Ch 7   |            |                 |
# |    | F   | 24 | ECF: Exceptions and Processes    | 8.1-8.3           |        |            | Exam 2 (Ch 5-7) |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# | 11 | M   | 25 |                                  | 8.4               |        |            |                 |
# |    | W   | 26 | ECF: Signals and Non-Local Jumps | 8.5-8.8           |        |            |                 |
# |    | F   | 27 | Virtual Memory: Concepts         | 9.1-9.5           | Ch 8   |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# | 12 | M   | 28 |                                  | 9.6               |        | Shell Lab  |                 |
# |    | W   | 29 | Virtual Memory: Systems          | 9.7-9.8           |        |            |                 |
# |    | F   | 30 | Dynamic Memory: Basic            | 9.9               |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# | 13 | M   | 31 | Dynamic Memory: Advanced         | 9.10-9.11         |        |            |                 |
# |    | W   | 32 | Review for Exam 3                |                   | Ch 9   |            |                 |
# |    | F   | 33 | Inter-networking                 | 11.1-11.3         |        |            | Exam 3 (Ch 8-9) |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# | 14 | M   | 34 |                                  |                   |        | Malloc Lab |                 |
# |    | W   | 35 | Network Programming              | 11.4              |        |            |                 |
# |    | F   | 36 | Web Servers                      | 11.5-11.6         |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# | 15 | M   | 37 | Concurrent Programming           | 12.1-12.3         | Ch 11  |            |                 |
# |    | W   | 38 |                                  |                   |        |            |                 |
# |    | F   | 39 | Synchronization: Basic           | 12.4-12.5.3       |        |            |                 |
# |----+-----+----+----------------------------------+-------------------+--------+------------+-----------------|
# | 16 | M   |    |                                  |                   | Ch 12  |            |                 |
# |    | W   |    |                                  |                   |        |            |                 |
# |    | F   |    |                                  |                   |        |            |                 |
