cos284-ics.tex

\subsection{What Does Not Constitute Cheating?}
\label{sec:orgheadline15}

In contrast, the following are non-exhaustive examples of activities that do not violate
academic integrity.

\begin{enumerate}
\item Clarifying ambiguities or vague points in class handouts or textbooks.
\item Helping others use the computer systems, networks, compilers, debuggers, profilers, or
other system facilities.
\item Helping others with high-level design issues.
\item Helping others with high-level (not code-based) debugging.
\item Using code from the \texttt{CS:APP} website or from the class web pages.
\end{enumerate}

Be sure to store your work in protected directories, and log off when you leave an open
cluster, to prevent others from copying your work without your explicit assistance.

\bibliographystyle{plain}
\bibliography{courses}
\end{document}
%%% Local Variables:
%%% mode: latex
%%% TeX-master: t
%%% End:
